hpdc/slides-outline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-20 Wed 11:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="prateek s" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfd41f21">1. Title Slide</a></li>
<li><a href="#org004f70a">2. Transient Cloud VMs : Opportunities and Challenges</a>
<ul>
<li><a href="#org77355e7">2.1. Challenge: How to mitigate preemptions</a></li>
</ul>
</li>
<li><a href="#org5503ebc">3. Preemption Modeling State of the Art</a></li>
<li><a href="#orgd037dd4">4. Research Questions</a></li>
<li><a href="#orgf0b98bb">5. Outline</a></li>
<li><a href="#org3488e90">6. Empirical analysis of preemptions</a></li>
<li><a href="#orgc13bd01">7. Observation 1: Preemptions are Bathtub shaped</a></li>
<li><a href="#org711d94d">8. Observation 2: Holds across different types and times</a></li>
<li><a href="#orgf3ecdef">9. Constrained Preemptions are Not Memoryless</a></li>
<li><a href="#org43cdfa3">10. Constrained Preemptions are Difficult to model with existing failure distributions</a></li>
<li><a href="#org62fa30f">11. Our Model For Temporally constrained preemptions</a></li>
<li><a href="#org9b10590">12. Model Characteristics</a></li>
<li><a href="#org4f3bdde">13. Impact on Application Performance</a></li>
<li><a href="#orgca78648">14. Job Scheduling and VM Reuse Policy</a></li>
<li><a href="#org9e564c2">15. Checkpointing Policy</a></li>
<li><a href="#orgaa0552c">16. SciSpot: A Batch Computing Service</a>
<ul>
<li><a href="#org56f467f">16.1. Evaluation setup</a></li>
</ul>
</li>
<li><a href="#org4f34d16">17. Job failure reduction</a></li>
<li><a href="#orgc91628f">18. Checkpointing overhead</a></li>
<li><a href="#org502b1da">19. SciSpot eval?</a></li>
<li><a href="#org3a6395c">20. Related Work</a></li>
<li><a href="#org5e8bb6a">21. Future Directions</a></li>
<li><a href="#orgd594af4">22. Conclusion</a></li>
<li><a href="#org9f15931">23. END</a></li>
<li><a href="#orgd0e9d3a">24. Scratch</a></li>
<li><a href="#orgd2a998b">25. What about other transient servers?</a></li>
<li><a href="#org23d8655">26. Why</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfd41f21" class="outline-2">
<h2 id="orgfd41f21"><span class="section-number-2">1</span> Title Slide</h2>
</div>

<div id="outline-container-org004f70a" class="outline-2">
<h2 id="org004f70a"><span class="section-number-2">2</span> Transient Cloud VMs : Opportunities and Challenges</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Low-cost VMs that can be preempted unilaterally</li>
<li>Amazon EC2 spot instances, Google Preemptible VMs, Azure delay sensitive</li>
</ul>
</div>

<div id="outline-container-org77355e7" class="outline-3">
<h3 id="org77355e7"><span class="section-number-3">2.1</span> Challenge: How to mitigate preemptions</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Two main techniques:
</p>
<ol class="org-ol">
<li>Fault-tolerance (e.g., checkpointing, migration) to</li>
<li>Careful selection of VM type (size, location, etc.)</li>
</ol>

<p>
<b>Require a sound understanding of preemption characteristics</b>
</p>
<ul class="org-ul">
<li>Frequency of preemption -&gt; MTTF -&gt; optimal checkpointing frequency</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org5503ebc" class="outline-2">
<h2 id="org5503ebc"><span class="section-number-2">3</span> Preemption Modeling State of the Art</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>EC2 spot instances extensively analyzed</li>
<li>Historically, price-based preemption allowed easy modeling of preemptions</li>
</ul>


<p>
<b>What about <i>other</i> types of transient VMs?</b>
</p>
<ul class="org-ul">
<li>This paper: Google Preemptible VMs</li>
<li>Flat price -&gt; price based approaches not applicable</li>
<li>Distinguishing feature: Maximum lifetime of 24 hours. 
<ul class="org-ul">
<li><b>Temporally constrained</b></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgd037dd4" class="outline-2">
<h2 id="orgd037dd4"><span class="section-number-2">4</span> Research Questions</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Do GCP VMs have different preemption characteristics?</b>
<b>If so, what is the impact on applications?</b>
<b>Can we develop a model for temporally constrained preemptions?</b>
<b>Policies for checkpointing and scheduling based on the model</b> 
</p>
</div>
</div>


<div id="outline-container-orgf0b98bb" class="outline-2">
<h2 id="orgf0b98bb"><span class="section-number-2">5</span> Outline</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Motivation</li>
<li>Empirical Analysis</li>
<li>A Reliability Model for Temporal preemptions</li>
<li>Model based policies</li>
<li>SciSpot framework</li>
<li>Experimental Evaluation</li>
<li>Related Work</li>
</ul>
</div>
</div>


<div id="outline-container-org3488e90" class="outline-2">
<h2 id="org3488e90"><span class="section-number-2">6</span> Empirical analysis of preemptions</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Flat pricing -&gt; Empirical approach required</li>
<li>Collected 1000 preeemption data</li>
<li>Regions, types, time of day etc</li>
<li>Measure time to preemption</li>
</ul>
</div>
</div>


<div id="outline-container-orgc13bd01" class="outline-2">
<h2 id="orgc13bd01"><span class="section-number-2">7</span> Observation 1: Preemptions are Bathtub shaped</h2>
<div class="outline-text-2" id="text-7">
<p>
[Figure 1 with only the Empirical Data]
</p>

<p>
Preemption rates are non-uniform and have three distinct phases:
</p>
<ol class="org-ol">
<li>Initially [0-4 hrs]: High rate of preemptions</li>
<li>Middle period: Low preemption rate</li>
<li>Near deadline: High rate</li>
</ol>

<p>
[Maybe annotate the figure with these regions instead]
</p>
</div>
</div>

<div id="outline-container-org711d94d" class="outline-2">
<h2 id="org711d94d"><span class="section-number-2">8</span> Observation 2: Holds across different types and times</h2>
<div class="outline-text-2" id="text-8">
<p>
[Figure 2a, 2b] 
</p>

<ul class="org-ul">
<li>Preemption characteristics depend on type of VM, time of day, and region</li>
<li>General bathtub shape with the different failure rates</li>
</ul>
</div>
</div>


<div id="outline-container-orgf3ecdef" class="outline-2">
<h2 id="orgf3ecdef"><span class="section-number-2">9</span> Constrained Preemptions are Not Memoryless</h2>
<div class="outline-text-2" id="text-9">
<p>
Conventional reliability modeling, memoryless exponential failures:
</p>
<ul class="org-ul">
<li>Also used to model EC2 spot preemptions.</li>
<li>MTTF = 1/Failure-rate</li>
<li><b>Different preemption phases -&gt; Memoryless models not applicable</b></li>
</ul>

<p>
[Figure 1 with Empirical data and classical exponential] 
</p>
</div>
</div>


<div id="outline-container-org43cdfa3" class="outline-2">
<h2 id="org43cdfa3"><span class="section-number-2">10</span> Constrained Preemptions are Difficult to model with existing failure distributions</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Can we fit preemptions using other failure distributions?</li>
<li>Weibuill: Generalized form of exponential used to model bathtub failures</li>
<li>Gompertz-Makeham: Popular in actuarial science. Captures early deaths and accelerated aging.</li>
</ul>

<p>
[Figure 1 from paper]
</p>

<p>
<b>Temporal constraint -&gt; challenging to fit an existing failure model</b>
</p>
</div>
</div>


<div id="outline-container-org62fa30f" class="outline-2">
<h2 id="org62fa30f"><span class="section-number-2">11</span> Our Model For Temporally constrained preemptions</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Intuition: 2 failure processes.</li>
<li>Classical exponential failures during initial and middle parts</li>
<li>Positive exponential near the deadline</li>
</ul>

<p>
[Equation 1]
</p>

<p>
Our model uses four parameters:
</p>
<ul class="org-ul">
<li>&tau;<sub>1</sub> : rate of preemptions of initial phase</li>
<li>&tau;<sub>2</sub>: preemption rate near deadline (final phase)</li>
<li>b: Activation time of final phase</li>
<li>A: Scaling constant</li>
</ul>

<p>
[Animation of the above by adding different parameters would be great ]
</p>
</div>
</div>


<div id="outline-container-org9b10590" class="outline-2">
<h2 id="org9b10590"><span class="section-number-2">12</span> Model Characteristics</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Fit using least squares</li>
<li>Able to capture differences between VMs</li>
<li>Figure 2 from earlier</li>
<li>Differentiable everywhere -&gt; preemption density functions is:</li>
</ul>

<p>
[Equation 2] 
</p>
</div>
</div>


<div id="outline-container-org4f3bdde" class="outline-2">
<h2 id="org4f3bdde"><span class="section-number-2">13</span> Impact on Application Performance</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Bathtub preemptions significantly different from uniform preemptions</li>
<li>Preemption probability of a job depends on the age of the VM and the job length</li>
</ul>


<p>
[Fig 4b ]
</p>

<p>
Takeaway:
</p>
<ul class="org-ul">
<li>Bathtub preemptions beneficial for jobs &gt; 5 hours</li>
<li>Let VM "mature", then run job</li>
</ul>
</div>
</div>

<div id="outline-container-orgca78648" class="outline-2">
<h2 id="orgca78648"><span class="section-number-2">14</span> Job Scheduling and VM Reuse Policy</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>Tradeoff faced by jobs: either continue running on an "old" VM, or run on a newly launched VM.</li>
<li>New VMs have high initial preemption rate</li>
<li>Reusing a VM: preemption probability depends on age of VM and job length</li>
</ul>

<p>
[Add equation 8] 
</p>
</div>
</div>



<div id="outline-container-org9e564c2" class="outline-2">
<h2 id="org9e564c2"><span class="section-number-2">15</span> Checkpointing Policy</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>Classic Young-Daly approach: \(\tau = \sqrt{MTTF*\delta}\), where \(\delta\) is checkpoint write time</li>
<li>Non-uniform preemption rates -&gt;  rates not ideal</li>
<li>Our approach: Use Dynamic Programming to compute the "optimal" checkpointing schedule for a job</li>
</ul>
</div>
</div>

<div id="outline-container-orgaa0552c" class="outline-2">
<h2 id="orgaa0552c"><span class="section-number-2">16</span> SciSpot: A Batch Computing Service</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>Implemented a system for running scientific computing applications on Preemptible VMs</li>
<li>One more sentence here&#x2026;</li>
</ul>

<p>
[Figure 3 ]
</p>
</div>

<div id="outline-container-org56f467f" class="outline-3">
<h3 id="org56f467f"><span class="section-number-3">16.1</span> Evaluation setup</h3>
<div class="outline-text-3" id="text-16-1">
<ul class="org-ul">
<li>Simulation workloads: LULESH, Nanoconfinement, Shapes</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org4f34d16" class="outline-2">
<h2 id="org4f34d16"><span class="section-number-2">17</span> Job failure reduction</h2>
<div class="outline-text-2" id="text-17">
<p>
[Figure 6]
</p>

<ul class="org-ul">
<li>VM reuse policy does not launch jobs near the end of the VM's lifetime.</li>
<li>Job failure probability is reduced by up to 3x</li>
</ul>
</div>
</div>

<div id="outline-container-orgc91628f" class="outline-2">
<h2 id="orgc91628f"><span class="section-number-2">18</span> Checkpointing overhead</h2>
<div class="outline-text-2" id="text-18">
<p>
[Figure 8a] 
</p>

<ul class="org-ul">
<li>Checkpointing overhead is lower with our policy</li>
<li>Young-daly with initial high failure rate: higher frequency and overhead</li>
</ul>


<p>
Better than YD 
</p>
</div>
</div>

<div id="outline-container-org502b1da" class="outline-2">
<h2 id="org502b1da"><span class="section-number-2">19</span> SciSpot eval?</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>Costs are low</li>
<li>Early preemptions plus low means overhead is low</li>
</ul>

<p>
[ Fig 9a]
</p>
</div>
</div>

<div id="outline-container-org3a6395c" class="outline-2">
<h2 id="org3a6395c"><span class="section-number-2">20</span> Related Work</h2>
<div class="outline-text-2" id="text-20">
<ol class="org-ol">
<li>Spot price modeling</li>
<li>Systems using google preemptible VMs</li>
<li>Failure modeling</li>
</ol>
</div>
</div>

<div id="outline-container-org5e8bb6a" class="outline-2">
<h2 id="org5e8bb6a"><span class="section-number-2">21</span> Future Directions</h2>
<div class="outline-text-2" id="text-21">
<ol class="org-ol">
<li>What if preemption characteristics change? 
<ul class="org-ul">
<li>This paper studies the fundamental characteristics of temporally constrained preemptions</li>
<li>Current model fairly robust as long as general bathtub shape is maintained</li>
<li>Model drift can be detected when model specifics change</li>
</ul></li>

<li>Simpler models for constrained preemptions 
<ul class="org-ul">
<li>Phase-wise model: Fit separate models to the 2/3 different segments</li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-orgd594af4" class="outline-2">
<h2 id="orgd594af4"><span class="section-number-2">22</span> Conclusion</h2>
<div class="outline-text-2" id="text-22">
<ol class="org-ol">
<li>Google Preemptible VMs: 24 hour lifetime</li>
<li>Temporally constrained preemptions: new type of transient resource availability</li>
<li>Empirical study of &gt;1000 preemptions shows bathtub, and not uniform preemptions</li>
<li>We develop a multiple failure rate model</li>
<li>Scheduling and checkpointing policies improve job running times by _X.</li>
</ol>
</div>
</div>

<div id="outline-container-org9f15931" class="outline-2">
<h2 id="org9f15931"><span class="section-number-2">23</span> END</h2>
<div class="outline-text-2" id="text-23">
<p>
Thanks 
</p>
</div>
</div>

<div id="outline-container-orgd0e9d3a" class="outline-2">
<h2 id="orgd0e9d3a"><span class="section-number-2">24</span> Scratch</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>How frequently preemptions occur?</li>
<li>Useful for fault-tolerance policies such as periodic checkpointing.</li>
<li>Huge amount of analysis for EC2</li>
</ul>
</div>
</div>


<div id="outline-container-orgd2a998b" class="outline-2">
<h2 id="orgd2a998b"><span class="section-number-2">25</span> What about other transient servers?</h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>Preemption models are different</li>
<li>This paper: focus on <i>temporally constrained</i> preemptions</li>
<li>Google preemptible: 24 hour max lifetime</li>
</ul>
</div>
</div>



<div id="outline-container-org23d8655" class="outline-2">
<h2 id="org23d8655"><span class="section-number-2">26</span> Why</h2>
<div class="outline-text-2" id="text-26">
<ol class="org-ol">
<li>Allow principled policies</li>
<li>New type of preemption model that is not governed by price</li>
<li>May not be memoryless due to temporal constraint</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: prateek s</p>
<p class="date">Created: 2020-05-20 Wed 11:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
